# Marketing Leads Conversion - Data Sanity Checks
- Join Data
- Identify Data Types - Continuous, Categorical, Date
    - Convert to right Data Type
- Identify Missing Values
- Impute Missing Values
    - Continuous
    - Categorical
- Create Features
    - Lead_Creation_Date
    - Existing EMI Percentage

## 1/ Import Libraries

In [1]:
# pandas, numpy

## 2/ Import Data
- t1_leads
- t6_emi
- test

**Extra:** Join other tables to build a more comprehensive training data

In [30]:
t1_leads = pd.read_csv('t1_leads.csv', low_memory=False)
t6_emi = pd.read_csv('t6_emi.csv', low_memory=False)

test = pd.read_csv('test.csv', low_memory=False)

#t2_city = pd.read_csv('t2_city.csv', low_memory=False)
#t3_employer = pd.read_csv('t3_employer.csv', low_memory=False)
#t4_bank = pd.read_csv('t4_bank.csv', low_memory=False)
#t5_source = pd.read_csv('t5_source.csv', low_memory=False)

### Check first 5 rows

,ID,Gender,DOB,Lead_Creation_Date,City_Code,Employer_Code,Monthly_Income,Customer_Existing_Primary_Bank_Code,Contacted,Source,Existing_EMI,Loan_Amount,Loan_Period,Var1,Approved
0,APPC90493171225,Female,23-07-1979,15-07-2016,C10001,COM0044082,2000.0,B001,N,S122,0.0,NaN,NaN,0,0
1,APPD40611263344,Male,07-12-1986,04-07-2016,C10003,COM0000002,3500.0,B002,Y,S122,0.0,20000.0,2.0,10,0
2,APPE70289249423,Male,10-12-1982,19-07-2016,C10125,COM0005267,2250.0,B003,Y,S143,0.0,45000.0,4.0,0,0
3,APPF80273865537,Male,30-01-1989,09-07-2016,C10477,COM0004143,3500.0,B003,Y,S143,0.0,92000.0,5.0,7,0
4,APPG60994436641,Male,19-04-1985,20-07-2016,C10002,COM0001781,10000.0,B001,Y,S134,2500.0,50000.0,2.0,10,0

                ID  Interest_Rate   EMI
0  APPA10004965619          20.00   882
1  APPA10009948043          13.00  2307
2  APPA10014022611          16.00   730
3  APPA10020427809          20.00   743
4  APPA10034077602          13.99  1709

,ID,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Employer_Category2,Monthly_Income,...,Primary_Bank_Type,Contacted,Source,Source_Category,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
0,APPA70109647212,Male,03/06/88,05/07/16,C10028,C,COM0002222,A,4.0,2150.0,...,P,Y,S122,B,0.0,10000.0,3.0,20.0,372.0,4
1,APPB10687939341,Male,13/07/81,01/07/16,C10003,A,COM0001784,C,4.0,4200.0,...,P,Y,S133,C,0.0,69000.0,5.0,24.0,1985.0,7
2,APPC80449411414,Female,19/11/90,01/07/16,C10009,B,COM0045260,B,4.0,1000.0,...,P,N,S133,B,0.0,NaN,NaN,NaN,NaN,0
3,APPD30665094501,Female,15/10/92,01/07/16,C10005,A,COM0000085,A,3.0,1465.0,...,P,N,S133,C,0.0,NaN,NaN,NaN,NaN,0
4,APPE80379821637,Male,21/09/88,01/07/16,C10005,A,COM0006422,A,4.0,2340.0,...,P,Y,S143,B,500.0,10000.0,2.0,NaN,NaN,0

## 3/ Join Data

In [20]:
# Which join should you use?

In [ ]:
# Join City

In [ ]:
# Join Employer

,ID,Gender,DOB,Lead_Creation_Date,City_Code,Employer_Code,Monthly_Income,Customer_Existing_Primary_Bank_Code,Contacted,Source,Existing_EMI,Loan_Amount,Loan_Period,Var1,Approved,Interest_Rate,EMI
0,APPC90493171225,Female,23-07-1979,15-07-2016,C10001,COM0044082,2000.0,B001,N,S122,0.0,NaN,NaN,0,0,NaN,NaN
1,APPD40611263344,Male,07-12-1986,04-07-2016,C10003,COM0000002,3500.0,B002,Y,S122,0.0,20000.0,2.0,10,0,13.25,953.0
2,APPE70289249423,Male,10-12-1982,19-07-2016,C10125,COM0005267,2250.0,B003,Y,S143,0.0,45000.0,4.0,0,0,NaN,NaN
3,APPF80273865537,Male,30-01-1989,09-07-2016,C10477,COM0004143,3500.0,B003,Y,S143,0.0,92000.0,5.0,7,0,NaN,NaN
4,APPG60994436641,Male,19-04-1985,20-07-2016,C10002,COM0001781,10000.0,B001,Y,S134,2500.0,50000.0,2.0,10,0,NaN,NaN

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69713 entries, 0 to 69712
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ID                                   69713 non-null  object
 1   Gender                               69713 non-null  object
 2   DOB                                  69698 non-null  object
 3   Lead_Creation_Date                   69713 non-null  object
 4   City_Code                            68899 non-null  object
 5   Employer_Code                        65695 non-null  object
 6   Monthly_Income                       69713 non-null  float64
 7   Customer_Existing_Primary_Bank_Code  60322 non-null  object
 8   Contacted                            69713 non-null  object
 9   Source                               69713 non-null  object
 10  Existing_EMI                         69662 non-null  float64
 11  Loan_Amount                          42004 non-null  float64
 12  Loan_Period                          42004 non-null  float64
 13  Var1                                 69713 non-null  int64
 14  Approved                             69713 non-null  int64
 15  Interest_Rate                        22276 non-null  float64
 16  EMI                                  22276 non-null  float64
dtypes: float64(6), int64(2), object(9)
memory usage: 9.6+ MB

## 4/ Convert String to Date Format

### Convert: Lead_Creation_Date

In [23]:

# for test too

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69713 entries, 0 to 69712
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ID                                   69713 non-null  object
 1   Gender                               69713 non-null  object
 2   DOB                                  69698 non-null  object
 3   Lead_Creation_Date                   69713 non-null  datetime64[ns]
 4   City_Code                            68899 non-null  object
 5   Employer_Code                        65695 non-null  object
 6   Monthly_Income                       69713 non-null  float64
 7   Customer_Existing_Primary_Bank_Code  60322 non-null  object
 8   Contacted                            69713 non-null  object
 9   Source                               69713 non-null  object
 10  Existing_EMI                         69662 non-null  float64
 11  Loan_Amount                          42004 non-null  float64
 12  Loan_Period                          42004 non-null  float64
 13  Var1                                 69713 non-null  int64
 14  Approved                             69713 non-null  int64
 15  Interest_Rate                        22276 non-null  float64
 16  EMI                                  22276 non-null  float64
dtypes: datetime64[ns](1), float64(6), int64(2), object(8)
memory usage: 9.6+ MB

### Convert: DOB

In [25]:

#for test too

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69713 entries, 0 to 69712
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ID                                   69713 non-null  object
 1   Gender                               69713 non-null  object
 2   DOB                                  69698 non-null  datetime64[ns]
 3   Lead_Creation_Date                   69713 non-null  datetime64[ns]
 4   City_Code                            68899 non-null  object
 5   Employer_Code                        65695 non-null  object
 6   Monthly_Income                       69713 non-null  float64
 7   Customer_Existing_Primary_Bank_Code  60322 non-null  object
 8   Contacted                            69713 non-null  object
 9   Source                               69713 non-null  object
 10  Existing_EMI                         69662 non-null  float64
 11  Loan_Amount                          42004 non-null  float64
 12  Loan_Period                          42004 non-null  float64
 13  Var1                                 69713 non-null  int64
 14  Approved                             69713 non-null  int64
 15  Interest_Rate                        22276 non-null  float64
 16  EMI                                  22276 non-null  float64
dtypes: datetime64[ns](2), float64(6), int64(2), object(7)
memory usage: 9.6+ MB

## 5/ Identify Missing Values

### Option 1: info

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69713 entries, 0 to 69712
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   ID                                   69713 non-null  object
 1   Gender                               69713 non-null  object
 2   DOB                                  69698 non-null  datetime64[ns]
 3   Lead_Creation_Date                   69713 non-null  datetime64[ns]
 4   City_Code                            68899 non-null  object
 5   Employer_Code                        65695 non-null  object
 6   Monthly_Income                       69713 non-null  float64
 7   Customer_Existing_Primary_Bank_Code  60322 non-null  object
 8   Contacted                            69713 non-null  object
 9   Source                               69713 non-null  object
 10  Existing_EMI                         69662 non-null  float64
 11  Loan_Amount                          42004 non-null  float64
 12  Loan_Period                          42004 non-null  float64
 13  Var1                                 69713 non-null  int64
 14  Approved                             69713 non-null  int64
 15  Interest_Rate                        22276 non-null  float64
 16  EMI                                  22276 non-null  float64
dtypes: datetime64[ns](2), float64(6), int64(2), object(7)
memory usage: 9.6+ MB

### Option 2: isnull + sum

ID                                         0
Gender                                     0
DOB                                       15
Lead_Creation_Date                         0
City_Code                                814
Employer_Code                           4018
Monthly_Income                             0
Customer_Existing_Primary_Bank_Code     9391
Contacted                                  0
Source                                     0
Existing_EMI                              51
Loan_Amount                            27709
Loan_Period                            27709
Var1                                       0
Approved                                   0
Interest_Rate                          47437
EMI                                    47437
dtype: int64

### Option 3: Percentage Missing

ID                                     0.000000
Gender                                 0.000000
DOB                                    0.000215
Lead_Creation_Date                     0.000000
City_Code                              0.011676
Employer_Code                          0.057636
Monthly_Income                         0.000000
Customer_Existing_Primary_Bank_Code    0.134709
Contacted                              0.000000
Source                                 0.000000
Existing_EMI                           0.000732
Loan_Amount                            0.397472
Loan_Period                            0.397472
Var1                                   0.000000
Approved                               0.000000
Interest_Rate                          0.680461
EMI                                    0.680461
dtype: float64

## **Additional : Export Missing Value Perc Data
- Convert Series (Index + Values) to DataFrame
- Export Table (use name - missing_value_summary.csv)

In [39]:
# Create Series of Percentage Missing
missing_value_percentage =

In [42]:
# Check Data Type

pandas.core.series.Series

In [45]:
# Create DataFrame
missing_value_summary =

In [47]:
#Export DataFrame

## 6/ Impute Missing Values

### 1/ Continuous - Loan_Period

In [59]:
# Check Missing

27709

#### Option 1: fillna - default options
- bfill
- ffill

0

#### Option 2: fillna with mean, median, mode

0

#### Commit Changes to Missing Value Column

### 2/ Continuous - Loan_Amount

#### Option 1, 2: fillna

#### Commit Changes to Missing Value Column

### 3/ Categorical - City_Code/City_Category

#### Option 1,2 - fillna

C10001    10007
C10002     8716
C10003     8666
C10004     5843
C10005     5564
          ...
C10596        1
C10717        1
C10693        1
C10684        1
C10675        1
Name: City_Code, Length: 678, dtype: int64

### 4/ Categorical - Employer_Category1

#### Option 1, 3: fillna

## 7/ Build Model